Repository: 84000/data-translation-memory
Catalog: toh762-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ལྕགས་ཀྱི་མཆུ་ཞེས་བྱ་བའི་གཟུངས། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: The Noble Dhāraṇī of the Iron Beak [2] Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཡུལ་མ་ག་དྷཱ་ནས་རྒྱུ་ཞིང་ཨ་མྲའི་ཚལ་དུ་གཤེགས་ཏེ་བྱོན་ནས།
en: The Blessed One was traveling through the land of Magadha when he arrived at a mango grove.

source: ཨ་མྲའི་ཚལ་དུ་ལུས་འཕགས་རིའི་དབང་པོའི་བྲག་ཕུག་ན་བཞུགས་སོ། །
en: At that mango grove, he took up residence in the Indra’s Rock Cave on Vaidehaka Mountain.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Śakra the lord of the devas then appeared before the Blessed One.

source: བཅོམ་ལྡན་འདས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He bowed his head at the Blessed One’s feet, sat to one side, and then Śakra the lord of the devas spoke to the Blessed One as follows.

source: བཅོམ་ལྡན་འདས་ལྷ་མ་ཡིན་རྣམས་ནི་རབ་ཏུ་ལྷ་རྣམས་ཀྱི་ཡུན་རིང་པོའི་དགྲ་ལགས་ན།
en: “Blessed One, the asuras are truly the long-time adversaries of the devas.

source: དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་དྲན་པའི་ཆོས་བསྟན་དུ་གསོལ།
en: With regard to it, Blessed One, please bestow a teaching on recollection.

source: འཛམ་བུའི་གླིང་པའི་འཇིག་རྟེན་ཤཱཀྱ་ཐུབ་པའི་ཞིང་ཁམས་ན། མིར་གྱུར་པའི་སེམས་ཅན་རྣམས་ཀྱི་འཁོར་ན་དགེ་སློང་ཕ་དང་། དགེ་སློང་མ་དང་། དགེ་ཚུལ་ཕ་དང་། དགེ་ཚུལ་ཕ་དང་། །དགེ་ཚུལ་མ་དང་། དགེ་བསྙེན་ཕ་དང་། དགེ་བསྙེན་མ་དང་། དམ་པའི་ཆོས་འཇིག་པ་ལ་བསྲུང་བའི་ཐབས་བསྟན་དུ་གསོལ།
en: Please give a teaching that will serve as a method for the bhikṣus, bhikṣuṇīs, śrāmaṇeras, śrāmaṇerīs, upāsakas, and upāsikās among the gatherings of human beings in the world of Jambudvīpa, the realm of Śākyamuni, to protect the sacred Dharma from destruction.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ལྷའི་དབང་པོ་ཁྱོད་ཀྱིས་ལྕགས་ཀྱི་མཆུའི་གཟུངས།
en: The Blessed One told Śakra the lord of the devas, “Lord of the devas, uphold the dhāraṇī of the iron beak.

source: ཐམས་ཅད་སྐྲག་པར་བྱེད་པ། ལྷ་མ་ཡིན་ལ་ཐོག་སྨད་ལྔ་འབེབས་པ།
en: It instills terror in everyone and smites the asuras with five-pointed thunderbolts.

source: འཇིག་རྟེན་གྱི་རིམས་ནད་ཞི་བར་བྱེད་པ། འཇིག་རྟེན་ཐམས་ཅད་དུ་ཞི་བར་བྱེད་པ།
en: It alleviates the world of infectious diseases and brings peace to the whole world.

source: དུག་ཐམས་ཅད་འཇིལ་བ། མཚོན་ཐམས་ཅད་རེངས་པར་བྱེད་པ། །
en: It neutralizes all poisons and stops all weapons.

source: རྐང་མེད་དང་། རྐང་གཉིས་པ་དང་། རྐང་བཞི་ཐམས་ཅད་རེངས་པར་བྱེད་པ། དགྲ་ཐམས་ཅད་ཕུང་བར་བྱེད་པ། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། སྦྱིན་བྱེད་མའི་བུ་དང་།
en: It paralyzes all legless, two-legged, and four-legged beings and defeats all adversaries.

source: ཤ་ཟ་དང་། བརྗེད་བྱེད་དང་། སྨྱོ་བྱེད་དང་། འགྲོ་བ་དྲག་ཤུལ་དུ་སྤྱོད་པ་རབ་ཏུ་འཇིག་པར་བྱེད་པ།
en: It destroys asuras, garuḍas, daityas, piśācas, apasmāras, unmādas, and malevolent beings.

source: འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་དང་། མཚང་འདྲུ་བ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པའི་འཕགས་པའི་ལྕགས་ཀྱི་མཆུ་འདི་ཟུང་ཤིག །
en: It brings peace from all conflicts, wars, discord, and scandals.

source: ཐམས་ཅད་མི་འཇིགས་པའི་ལྕགས་ཀྱི་མཆུའི་གཟུངས་ཀྱི་རིག་སྔགས་བརྗོད་པར་བྱའོ། །ཏདྱ་ཐཱ།
en: This is the noble iron beak.

source: བ་ག་ཙ་ནི། ཤུ་ཏི་ཤུ་མ་ལི། ག་ཤ་ཤ་ཤ་ཏ་ཏ་བི་ར་ཏི། ཧུ་ཡུ་ཧུ་ཡུ་རི་ཏི་སྭཱ་ཧཱ། རྒྱ་མཚོ་ལ་འབར་ལི་ཏི་གཏོར་རོ། །
en: I will recite the vidyāmantra of the iron beak dhāraṇī of freedom from all danger: tadyātha | vagacani śuti śumali gaśaśa śatata virati huyu huyu riti svāhā | “Scatter black mustard seeds on the ocean.

source: ཇི་ལྟར་འདོད་པ་བཞིན་འབབ་བོ། །
en: It will rain as you wish.

source: ཀླུའི་གནས་སུ་ཕུར་བུ་ལ་བྱེ་བ་གྲངས་མེད་པ་བཟླས་ལ། ཀླུའི་གནས་སུ་བཏབ་ན། སེར་བ་དང་། ཐོག་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་འབབ་བོ། །སརྦ་ནཱ་ག་ནཱཾ་ཨ་བ་པཱི་ཪྻ་ཕོབ། ནཱ་ག་ཤར་ཤར་ཕོབ། ནཱ་ག་རཀྵ་ཕོབ།
en: If one chants this countless tens of trillions of times on a small stake at a place where nāgas are found and plants the stake at that nāga site, hail and thunderbolts will come crashing down as you desire.

source: ར་ཙི་སྲི་བཛྲ་ཧཱུྃ་ཕཊ། དྲག་པོ་ཡུལ་ཁམས་ཀྱི་དགྲར་གྱུར་པ་ཟློག་པ། མེས་གཏོར་བའི་ཐོག་སྨད་ལྔ་འབེབས་པ། ལྷའི་དབང་པོ་ཐམས་ཅད་ཟིལ་གྱིས་མནན་པའི་ལྕགས་ཀྱི་མཆུའི་གཟུངས་འདི་ཡིས་ལྷ་མ་ཡིན་རྨོངས་སུ་འཇུག་པ། འཁོར་རྣམ་བཞི་བསྲུང་བ་ཐེག་པ་ཆེན་པོའི་ཆོས་དགྲ་སྲུང་བའོ། །
en: sarva­nāgānām apavīrya descend | nāga śara śara descend | nāga rakṣa descend | raci sri vajra hūṃ phaṭ | “This wrathful dhāraṇī of the iron beak that averts the adversaries of the country, brings down five-pointed thunderbolts that blaze with fire, and overpowers every lord of the devas will bewilder the asuras, keep the fourfold assembly safe, and protect the teachings of the Great Vehicle against enemies.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: After the Blessed One had spoken, Śakra the lord of the devas rejoiced and praised what the Blessed One had taught.

source: འཕགས་པ་ལྕགས་ཀྱི་མཆུའི་གཟུངས་རྫོགས་སྷོ།།
en: This concludes “The Noble Dhāraṇī of the Iron Beak [2].”
